
## Plan Result (prod)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.prl_pcq_token_key
* Update
  * azurerm_key_vault_secret.app_insights_connection_string


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://prl-prod.vault.azure.net/secrets/app-insights-connection-string/69f8159d826c4fccb2304d1cf51c270c"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.prl_pcq_token_key will be created
  + resource "azurerm_key_vault_secret" "prl_pcq_token_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/prl-prod/providers/Microsoft.KeyVault/vaults/prl-prod"
      + name                    = "prl-pcq-token-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.application_insights.azurerm_application_insights.this has changed
  ~ resource "azurerm_application_insights" "this" {
      ~ connection_string                     = (sensitive value)
        id                                    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/prl-prod/providers/Microsoft.Insights/components/prl-appinsights-prod"
        name                                  = "prl-appinsights-prod"
        tags                                  = {
            "application"         = "family-private-law"
            "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#prl-tech-notifications"
            "environment"         = "production"
            "managedBy"           = "Private Law"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":37,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->